app/controllers/articles_controller.rb

	def create
		@article = Article.new(params.require(:article).permit(:title, :text))

		@article.save
---
INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('dddddd', 'aaaaaaqwe', '2016-04-04 05:50:14', '2016-04-04 05:50:14')