app/controllers/auth_groups_controller.rb

SELECT `auth_groups`.* FROM `auth_groups`
---
  def index
    @auth_groups = AuthGroup.all

SELECT  `auth_groups`.* FROM `auth_groups` WHERE `auth_groups`.`id` = 3 LIMIT 1
---
    def set_auth_group
      @auth_group = AuthGroup.find(params[:id])