app/controllers/employee_groups_controller.rb

  def index
    @employee_groups = EmployeeGroup.all
---
SELECT `employee_groups`.* FROM `employee_groups`

    def set_employee_group
      @employee_group = EmployeeGroup.find(params[:id])
---
SELECT  `auth_groups`.* FROM `auth_groups` WHERE `auth_groups`.`id` = 1 LIMIT 1