app/controllers/employees_controller.rb

INSERT INTO `employees` (`cedula`, `name`, `last_name`, `phone_number`, `email`, `address`, `note`, `startdate`, `created_at`, `updated_at`) VALUES ('qqqqqqqqq', '1111111111', '22222222222', '545555555555', '', '', '', '2013-04-14', '2016-04-14 17:41:41', '2016-04-14 17:41:41')
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE `employees` SET `email` = 'qwe', `address` = 'ddd', `note` = '', `startdate` = '2016-04-14', `updated_at` = '2016-04-14 17:41:17' WHERE `employees`.`id` = 1
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)

SELECT  `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1
---
    def set_employee
      @employee = Employee.find(params[:id])