app/controllers/loans_controller.rb

  def index
    @loans = Loan.all
---
SELECT `loans`.* FROM `loans`

  def create
    @loan = Loan.new(loan_params)

    respond_to do |format|
      if @loan.save
---
INSERT INTO `loans` (`employee_id`, `description`, `created_at`, `updated_at`) VALUES (1, '', '2016-04-16 08:36:18', '2016-04-16 08:36:18')

  def update
    respond_to do |format|
      if @loan.update(loan_params)
---
UPDATE `loans` SET `monto` = 66.36, `description` = 'dbu', `updated_at` = '2016-04-16 08:36:32' WHERE `loans`.`id` = 1

    def set_loan
      @loan = Loan.find(params[:id])
---
SELECT  `loans`.* FROM `loans` WHERE `loans`.`id` = 1 LIMIT 1