app/controllers/pools_controller.rb

  def index
    @pools = Pool.all
---
SELECT `pools`.* FROM `pools`

  def create
    @pool = Pool.new(pool_params)

    respond_to do |format|
      if @pool.save
---
INSERT INTO `pools` (`odt_id`, `n_comprobante`, `description`, `created_at`, `updated_at`) VALUES (1, '', '', '2016-04-16 08:32:33', '2016-04-16 08:32:33')

  def update
    respond_to do |format|
      if @pool.update(pool_params)
---
UPDATE `pools` SET `monto` = 555555.0, `n_comprobante` = 'dadbnajdbnkajd', `description` = 'deqkdlñqwdkñ\r\n', `updated_at` = '2016-04-16 08:34:18' WHERE `pools`.`id` = 1

    def set_pool
      @pool = Pool.find(params[:id])
---
SELECT  `pools`.* FROM `pools` WHERE `pools`.`id` = 1 LIMIT 1