app/controllers/razon_socials_controller.rb

  def index
    permission_denied and return  if current_user.cannot 'read_razon_social'
    @razon_socials = RazonSocial.all
---
SELECT `razon_socials`.* FROM `razon_socials`

  def create
    permission_denied and return  if current_user.cannot 'create_razon_social'
    @razon_social = RazonSocial.new(razon_social_params)

    respond_to do |format|
      if @razon_social.save
---
INSERT INTO `razon_socials` (`rif_ci`, `name`, `description`, `phone`, `email`, `address`, `contact_name`, `contact_phone`, `contact_email`, `created_at`, `updated_at`) VALUES ('213123', '', 'asdasd', 'asd', '11', '1ddd', 'd', '', '', '2016-04-14 16:30:39', '2016-04-14 16:30:39')

    def set_razon_social
      @razon_social = RazonSocial.find(params[:id])
---
SELECT  `razon_socials`.* FROM `razon_socials` WHERE `razon_socials`.`id` = 4 LIMIT 1